[
  {
    "town": "preston",
    "imageUrl": "https://www.prestonidaho.net/images/Welcome2.jpg",
    "byline": "Eric Brill - KMVT 11",
    "pubDate": "Nov 25, 2020 10:23 PM PST",
    "title": "Southern Idaho Update",
    "text": [
      "Quiet but nice weather conditions are expected in Southern Idaho for the last weekend of November. Temperatures are expected to climb back to near average values for the region, which means lower 40s for the Magic Valley and Mini-Cassia Region, and middle 30s for the Wood River Valley. Partly cloudy to sunny skies are in the forecast as well, so there shouldn’t be a big issue when it comes to cloud coverage this weekend, either!",
      "A cold front is expected to move through Southern Idaho overnight Monday into Tuesday, which means that temperatures are going to fall a little bit for the first day of December. I anticipate high temps dropping by about 10° in the Magic Valley and Mini-Cassia Region from Monday to Tuesday, while the Wood River Valley will drop a few degrees. There will also be a few showers around overnight Monday into Tuesday, but it should not be a big weather-maker for the region. This is the best chance of showers over the next week, and as a matter of fact, it is the only chance of showers over the next seven days. A little bit of a breeze may also develop overnight Monday into Tuesday, which will probably be the breeziest duration of time through the next week."
    ]
  },
  {
    "town": "fish-haven",
    "imageUrl": "https://photos.zillowstatic.com/p_e/ISi3y3mmoxfu7r0000000000.jpg",
    "byline": "Wikipedia",
    "pubDate": "Oct 22, 2020 3:17 PM UTC",
    "title": "Fish Haven, Idaho",
    "text": [
      "Fish Haven, originally named Rush Creek, is an unincorporated community along the shores of Bear Lake in Bear Lake County, Idaho, United States. It is 4 km (2.5 miles) north of the Utah border.",
      "The first settlement at Fish Haven was made in 1864. A post office called Fish Haven was established in 1867, and remained in operation until 1962. The community was so named because nearby Bear Lake is a favorite fishing spot."
    ]
  },
  {
    "town": "soda-springs",
    "imageUrl": "https://bloximages.chicago2.vip.townnews.com/idahostatejournal.com/content/tncms/assets/v3/editorial/2/cb/2cb0407b-9f21-5649-929b-00e7673fb6f4/5de463f27ddd4.image.jpg?resize=750%2C563",
    "byline": "Journal Staff - IdahoStateJournal",
    "pubDate": "Nov 25, 2020",
    "title": "Blast of winter on Thanksgiving eve",
    "text": [
      "Multiple bands of snow are forecast to roll through East Idaho on Wednesday afternoon and evening.",
      "The National Weather Service has issued special weather alerts for East Idaho warning motorists about the potentially hazardous road conditions.",
      "Lower elevation areas such as Pocatello, Chubbuck, Blackfoot, Idaho Falls, Ammon, American Falls, Aberdeen, Fort Hall, Dubois, Rigby and Rexburg are forecast to receive 1 to 2 inches of snow Wednesday afternoon through evening.",
      "The rest of East Idaho including the Montpelier, <strong>Soda Springs</strong>, Lava Hot Springs, Inkom, Malad, McCammon, Arimo, Downey and Preston areas are expected to receive less than an inch of snow Wednesday afternoon through evening."
    ]
  }
]
